data/WS-Addressing/ws-addressing-7.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:64bb23cf-2557-44c6-89e3-52ef766bd624</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address><ReferenceParameters xmlns:customer="http://example.org/customer" customer:level="premium"><customer:CustomerKey>Key#123456789</customer:CustomerKey></ReferenceParameters><Metadata xmlns:customer="http://example.org/customer" customer:total="1"></Metadata><customer:Metadata xmlns:customer="http://example.org/customer"><customer:extraStuff>This should be ignored</customer:extraStuff></customer:Metadata></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1108</notify></S:Body></S:Envelope>